app/controllers/articles_controller.rb

  def update
    byebug
    @article = Article.find(params[:id])
  @article.update(title: params[:title], description: params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-30 13:05:08.212170"], ["id", 1]]